In [29]:
import importlib
import subprocess

import Advanced_SQL as asql
import duckdb
import SQL as sql

_ = importlib.reload(asql)
_ = importlib.reload(sql)

Use this cell to test any sql queries. This can be done in one of the following ways:

1. Fill in the `qry` within the """ """.
2. Call the question functions that you have already filled in from the SQL.py and Advanced_SQL.py files. An example of question_1 being called from the SQL.py file is currently commented out.

This cell can be copied if you wish to run multiple queries.

In [30]:
qry = """  
SELECT * FROM customers
"""

qry = sql.question_2()


with duckdb.connect("database/loan.db") as cursor:
    result_set = cursor.execute(qry).df()

result_set

        Name  Surname  Income
0     jayden  spencer   89963
1    madisyn   isaiah   89954
2     camden    oscar   89878
3       ella     sean   89746
4     caiden  eduardo   89690
..       ...      ...     ...
507     kira     luke   40346
508   everly    micah   40208
509    manha     noah   40110
510     sima  janelle   40104
511    avery      lia   40065

[512 rows x 3 columns]

Should you break/incorrectly update any database tables, the database can be reset by running the following cell

In [45]:
load_script_path = "database/database_load.py"
subprocess.run(["python3", load_script_path])

CompletedProcess(args=['python3', 'database/database_load.py'], returncode=0)